(%i1) load ("boxcar_convolution.mac");
(%o1)                       boxcar_convolution.mac
(%i2)  'integrate (B[11,13](t)*B[9,12.5](t)*B[x-1,x](t)*f(t), t, minf, inf);
(%o2) extract_variable_boxcar([aa = f(t), uu = t, cc = x, bb = x - 1], t, 11, 
                                                                          12.5)
(%i3)  'integrate (B[11,13](t)*B[x-1,x](t)*f(t), t, minf, inf);
(%o3) extract_variable_boxcar([aa = f(t), uu = t, cc = x, bb = x - 1], t, 11, 
                                                                            13)
(%i4)  'integrate (B[11,13](t)*B[9,19](t)*f(t), t, minf, inf);
                                   13
                                  /
                                  [
(%o4)                             I   f(t) dt
                                  ]
                                  /
                                   11
(%i5)  'integrate (B[x-1,x](t)*f(t), t, minf, inf);
(%o5) extract_variable_boxcar([aa = f(t), uu = t, cc = x, bb = x - 1], t, 
                                                                     minf, inf)
(%i6) extract_variable_boxcar (eqns, variable, lower_limit, upper_limit) := block ([aa, bb, cc, uu, xx],
  [aa, bb, cc, uu] : map (lambda ([x], assoc (x, eqns)), '[aa, bb, cc, uu]),
  /* ASSUME CC - BB = UPPER_LIMIT - LOWER_LIMIT; SHOULD INCLUDE ALL CASES HERE !! */
  /* ASSUME LINEAR EQUATIONS !! */
  xx : first (listofvars ([bb, cc])), /* ASSUME EXACTLY ONE VARIABLE !! */
  [[rhs (first (solve (lower_limit = cc, xx))), rhs (first (solve (upper_limit = cc, xx)))],
   [rhs (first (solve (lower_limit = bb, xx))), rhs (first (solve (upper_limit = bb, xx)))]],
  B[%%[1][1], %%[1][2]](xx) * 'integrate (aa, uu, lower_limit, cc)
   + B[%%[2][1], %%[2][2]](xx) * 'integrate (aa, variable, bb, upper_limit));
(%o6) extract_variable_boxcar(eqns, variable, lower_limit, upper_limit) := 
block([aa, bb, cc, uu, xx], [aa, bb, cc, uu] : 
map(lambda([x], assoc(x, eqns)), '([aa, bb, cc, uu])), 
xx : first(listofvars([bb, cc])), [[rhs(first(solve(lower_limit = cc, xx))), 
rhs(first(solve(upper_limit = cc, xx)))], 
[rhs(first(solve(lower_limit = bb, xx))), 
rhs(first(solve(upper_limit = bb, xx)))]], 
                     cc
                    /
                    [
B              (xx) I            aa duu
 (%% ) , (%% )      ]
    1       1       /
      1       2      lower_limit
                        upper_limit
                       /
                       [
 + B              (xx) I            aa dvariable)
    (%% ) , (%% )      ]
       2       2       /
         1       2      bb
(%i7)  'integrate (B[11,13](t)*B[9,12.5](t)*B[x-1,x](t)*f(t), t, minf, inf);

rat: replaced 12.5 by 25/2 = 12.5

rat: replaced 13.5 by 27/2 = 13.5
            12.5                            x
           /                               /
           [                               [
(%o7)     (I      f(t) dt) B        (x) + (I   f(t) dt) B        (x)
           ]                12, 27/2       ]             11, 25/2
           /                               /
            x - 1                           11
(%i8) %, nouns;

rat: replaced 13.5 by 27/2 = 13.5

rat: replaced 12.5 by 25/2 = 12.5

rat: replaced 13.5 by 27/2 = 13.5
            12.5                            x
           /                               /
           [                               [
(%o8)     (I      f(t) dt) B        (x) + (I   f(t) dt) B        (x)
           ]                12, 27/2       ]             11, 25/2
           /                               /
            x - 1                           11
(%i9) integrate (B[0,1](t)*B[x-1,x](t), t, minf, inf);
(%o9)                    (2 - x) B    (x) + x B    (x)
                                  1, 2         0, 1
(%i10) plot2d (%o9, [x, -1, 3]), B[a,b](u) := if u >= a and u < b then 1 else 0;
(%o10)              [/home/robert/maxout8692.gnuplot_pipes]
(%i11) ii:subst(x=t, %o9);
(%o11)                   (2 - t) B    (t) + t B    (t)
                                  1, 2         0, 1
(%i12) integrate (ii*B[x-1,x](t), t, minf, inf);
            inf
           /
           [
(%o12) (- (I      t B    (t) dt) B                 (x))
           ]         1, 2         minf + 1, inf + 1
           /
            x - 1
       inf
      /
      [
 + 2 (I      B    (t) dt) B                 (x)
      ]       1, 2         minf + 1, inf + 1
      /
       x - 1
     inf
    /
    [
 + (I      t B    (t) dt) B                 (x)
    ]         0, 1         minf + 1, inf + 1
    /
     x - 1
     x                                       x
    /                                       /
    [                                       [
 - (I     t B    (t) dt) B         (x) + 2 (I     B    (t) dt) B         (x)
    ]        1, 2         minf, inf         ]      1, 2         minf, inf
    /                                       /
     minf                                    minf
     x
    /
    [
 + (I     t B    (t) dt) B         (x)
    ]        0, 1         minf, inf
    /
     minf
(%i13) linel:124;
(%o13)                                                      124
(%i14) %o12;
            inf                                               inf
           /                                                 /
           [                                                 [
(%o14) (- (I      t B    (t) dt) B                 (x)) + 2 (I      B    (t) dt) B                 (x)
           ]         1, 2         minf + 1, inf + 1          ]       1, 2         minf + 1, inf + 1
           /                                                 /
            x - 1                                             x - 1
     inf                                            x                                       x
    /                                              /                                       /
    [                                              [                                       [
 + (I      t B    (t) dt) B                 (x) - (I     t B    (t) dt) B         (x) + 2 (I     B    (t) dt) B         (x)
    ]         0, 1         minf + 1, inf + 1       ]        1, 2         minf, inf         ]      1, 2         minf, inf
    /                                              /                                       /
     x - 1                                          minf                                    minf
     x
    /
    [
 + (I     t B    (t) dt) B         (x)
    ]        0, 1         minf, inf
    /
     minf
(%i15) ''%o12;
            inf                                               inf
           /                                                 /
           [                                                 [
(%o15) (- (I      t B    (t) dt) B                 (x)) + 2 (I      B    (t) dt) B                 (x)
           ]         1, 2         minf + 1, inf + 1          ]       1, 2         minf + 1, inf + 1
           /                                                 /
            x - 1                                             x - 1
     inf                                            x                                       x
    /                                              /                                       /
    [                                              [                                       [
 + (I      t B    (t) dt) B                 (x) - (I     t B    (t) dt) B         (x) + 2 (I     B    (t) dt) B         (x)
    ]         0, 1         minf + 1, inf + 1       ]        1, 2         minf, inf         ]      1, 2         minf, inf
    /                                              /                                       /
     x - 1                                          minf                                    minf
     x
    /
    [
 + (I     t B    (t) dt) B         (x)
    ]        0, 1         minf, inf
    /
     minf
(%i16) ii;
(%o16)                                         (2 - t) B    (t) + t B    (t)
                                                        1, 2         0, 1
(%i17) ii*B[x-1,x](t);
(%o17)                                  ((2 - t) B    (t) + t B    (t)) B        (t)
                                                  1, 2         0, 1      x - 1, x
(%i18) expand (%);
(%o18)                (- t B    (t) B        (t)) + 2 B    (t) B        (t) + t B    (t) B        (t)
                            1, 2     x - 1, x          1, 2     x - 1, x         0, 1     x - 1, x
(%i19) integrate (%, t, minf, inf);
                                                   2                        1                        x
                                                  /                        /                        /
                                                  [                        [                        [
(%o19) 2 ((3 - x) B    (x) + (x - 1) B    (x)) - (I      t dt) B    (x) + (I      t dt) B    (x) - (I  t dt) B    (x)
                   2, 3               1, 2        ]             2, 3       ]             1, 2       ]         1, 2
                                                  /                        /                        /
                                                   x - 1                    x - 1                    1
                                                                                                            x
                                                                                                           /
                                                                                                           [
                                                                                                        + (I  t dt) B    (x)
                                                                                                           ]         0, 1
                                                                                                           /
                                                                                                            0
(%i20) %, nouns;
                                                       2                             2
                                                      x  - 2 x + 1              1   x  - 2 x + 1
(%o20) 2 ((3 - x) B    (x) + (x - 1) B    (x)) - (2 - ------------) B    (x) + (- - ------------) B    (x)
                   2, 3               1, 2                 2         2, 3       2        2         1, 2
                                                                                                                  2
                                                                                               2                 x  B    (x)
                                                                                              x    1                 0, 1
                                                                                           - (-- - -) B    (x) + -----------
                                                                                              2    2   1, 2           2
(%i21) expand (%);
               2                                                                                   2
              x  B    (x)                  9 B    (x)                                3 B    (x)   x  B    (x)
                  2, 3                        2, 3       2                              1, 2          0, 1
(%o21)        ----------- - 3 x B    (x) + ---------- - x  B    (x) + 3 x B    (x) - ---------- + -----------
                   2             2, 3          2            1, 2           1, 2          2             2
(%i22) plot2d (%o21, [x, -1, 3]), B[a,b](u) := if u >= a and u < b then 1 else 0;
(%o22)                                    [/home/robert/maxout8692.gnuplot_pipes]
(%i23) expand (subst(x=t, %o21)*B[x-1,x](t));
        2
       t  B    (t) B        (t)                               9 B    (t) B        (t)
           2, 3     x - 1, x                                     2, 3     x - 1, x       2
(%o23) ------------------------ - 3 t B    (t) B        (t) + ----------------------- - t  B    (t) B        (t)
                  2                    2, 3     x - 1, x                 2                  1, 2     x - 1, x
                                                                                                     2
                                                                          3 B    (t) B        (t)   t  B    (t) B        (t)
                                                                             1, 2     x - 1, x          0, 1     x - 1, x
                                            + 3 t B    (t) B        (t) - ----------------------- + ------------------------
                                                   1, 2     x - 1, x                 2                         2
(%i24) integrate (%, t, minf, inf);
                                                   3                         x
                                                  /                         /
                                                  [       2                 [   2
                                                 (I      t  dt) B    (x) + (I  t  dt) B    (x)
                                                  ]              3, 4       ]          2, 3
       9 ((4 - x) B    (x) + (x - 2) B    (x))    /                         /
                   3, 4               2, 3         x - 1                     2
(%o24) --------------------------------------- + ---------------------------------------------
                          2                                            2
        3                        x
       /                        /                    3 ((3 - x) B    (x) + (x - 1) B    (x))
       [                        [                                2, 3               1, 2
 - 3 ((I      t dt) B    (x) + (I  t dt) B    (x)) - ---------------------------------------
       ]             3, 4       ]         2, 3                          2
       /                        /
        x - 1                    2
                                                                                 1                         x
                                                                                /                         /
                                                                                [       2                 [   2
                                                                               (I      t  dt) B    (x) + (I  t  dt) B    (x)
        2                        x                     2                        ]              1, 2       ]          0, 1
       /                        /                     /                         /                         /
       [                        [                     [       2                  x - 1                     0
 + 3 ((I      t dt) B    (x) + (I  t dt) B    (x)) - (I      t  dt) B    (x) + ---------------------------------------------
       ]             2, 3       ]         1, 2        ]              2, 3                            2
       /                        /                     /
        x - 1                    1                     x - 1
     x
    /
    [   2
 - (I  t  dt) B    (x)
    ]          1, 2
    /
     1
(%i25) %, nouns;
             3      2                         3
            x  - 3 x  + 3 x - 1              x    8
       (9 - -------------------) B    (x) + (-- - -) B    (x)            2                         2
                     3            3, 4       3    3   2, 3          9   x  - 2 x + 1              x
(%o25) ------------------------------------------------------ - 3 ((- - ------------) B    (x) + (-- - 2) B    (x))
                                 2                                  2        2         3, 4       2        2, 3
   9 ((4 - x) B    (x) + (x - 2) B    (x))            2                         2
               3, 4               2, 3               x  - 2 x + 1              x    1
 + --------------------------------------- + 3 ((2 - ------------) B    (x) + (-- - -) B    (x))
                      2                                   2         2, 3       2    2   1, 2
   3 ((3 - x) B    (x) + (x - 1) B    (x))         3      2
               2, 3               1, 2        8   x  - 3 x  + 3 x - 1
 - --------------------------------------- - (- - -------------------) B    (x)
                      2                       3            3            2, 3
                                         3
         3      2                       x  B    (x)
    1   x  - 3 x  + 3 x - 1                 0, 1
   (- - -------------------) B    (x) + -----------     3
    3            3            1, 2           3         x    1
 + ------------------------------------------------ - (-- - -) B    (x)
                          2                            3    3   1, 2
(%i26) expand (%);
           3                                                           3
          x  B    (x)                                   32 B    (x)   x  B    (x)
              3, 4          2                               3, 4          2, 3         2
(%o26) (- -----------) + 2 x  B    (x) - 8 x B    (x) + ----------- + ----------- - 4 x  B    (x) + 10 x B    (x)
               6               3, 4           3, 4           3             2              2, 3            2, 3
                                                        3                                                         3
                                         22 B    (x)   x  B    (x)                                  2 B    (x)   x  B    (x)
                                             2, 3          1, 2         2                              1, 2          0, 1
                                       - ----------- - ----------- + 2 x  B    (x) - 2 x B    (x) + ---------- + -----------
                                              3             2              1, 2           1, 2          3             6
(%i27) plot2d (%, [x, -1, 3]), B[a,b](u) := if u >= a and u < b then 1 else 0;
(%o27)                                    [/home/robert/maxout8692.gnuplot_pipes]
(%i28) plot2d (%, [x, -1, 5]), B[a,b](u) := if u >= a and u < b then 1 else 0;
plot2d: expression evaluates to non-numeric value everywhere in plotting range.
plot2d: nothing to plot.
(%o28)                                                     false
(%i29) plot2d (%o26, [x, -1, 5]), B[a,b](u) := if u >= a and u < b then 1 else 0;
(%o29)                                    [/home/robert/maxout8692.gnuplot_pipes]
(%i30) expand (subst(x=t, %o26)*B[x-1,x](t));
           3
          t  B    (t) B        (t)                                                             32 B    (t) B        (t)
              3, 4     x - 1, x          2                                                         3, 4     x - 1, x
(%o30) (- ------------------------) + 2 t  B    (t) B        (t) - 8 t B    (t) B        (t) + ------------------------
                     6                      3, 4     x - 1, x           3, 4     x - 1, x                 3
    3
   t  B    (t) B        (t)                                                             22 B    (t) B        (t)
       2, 3     x - 1, x         2                                                          2, 3     x - 1, x
 + ------------------------ - 4 t  B    (t) B        (t) + 10 t B    (t) B        (t) - ------------------------
              2                     2, 3     x - 1, x            2, 3     x - 1, x                 3
    3
   t  B    (t) B        (t)                                                            2 B    (t) B        (t)
       1, 2     x - 1, x         2                                                        1, 2     x - 1, x
 - ------------------------ + 2 t  B    (t) B        (t) - 2 t B    (t) B        (t) + -----------------------
              2                     1, 2     x - 1, x           1, 2     x - 1, x                 3
    3
   t  B    (t) B        (t)
       0, 1     x - 1, x
 + ------------------------
              6
(%i31) integrate (%, t, minf, inf);
                                                    4                         x
                                                   /                         /
                                                   [       3                 [   3
                                                  (I      t  dt) B    (x) + (I  t  dt) B    (x)
                                                   ]              4, 5       ]          3, 4
       32 ((5 - x) B    (x) + (x - 3) B    (x))    /                         /
                    4, 5               3, 4         x - 1                     3
(%o31) ---------------------------------------- - ---------------------------------------------
                          3                                             6
        4                         x                         4                        x
       /                         /                         /                        /
       [       2                 [   2                     [                        [
 + 2 ((I      t  dt) B    (x) + (I  t  dt) B    (x)) - 8 ((I      t dt) B    (x) + (I  t dt) B    (x))
       ]              4, 5       ]          3, 4           ]             4, 5       ]         3, 4
       /                         /                         /                        /
        x - 1                     3                         x - 1                    3
                                                3                         x
                                               /                         /
                                               [       3                 [   3
                                              (I      t  dt) B    (x) + (I  t  dt) B    (x)
                                               ]              3, 4       ]          2, 3
   22 ((4 - x) B    (x) + (x - 2) B    (x))    /                         /
                3, 4               2, 3         x - 1                     2
 - ---------------------------------------- + ---------------------------------------------
                      3                                             2
        3                         x                          3                        x
       /                         /                          /                        /
       [       2                 [   2                      [                        [
 - 4 ((I      t  dt) B    (x) + (I  t  dt) B    (x)) + 10 ((I      t dt) B    (x) + (I  t dt) B    (x))
       ]              3, 4       ]          2, 3            ]             3, 4       ]         2, 3
       /                         /                          /                        /
        x - 1                     2                          x - 1                    2
                                               2                         x
                                              /                         /
                                              [       3                 [   3
                                             (I      t  dt) B    (x) + (I  t  dt) B    (x)
                                              ]              2, 3       ]          1, 2
   2 ((3 - x) B    (x) + (x - 1) B    (x))    /                         /
               2, 3               1, 2         x - 1                     1
 + --------------------------------------- - ---------------------------------------------
                      3                                            2
        2                         x                         2                        x
       /                         /                         /                        /
       [       2                 [   2                     [                        [
 + 2 ((I      t  dt) B    (x) + (I  t  dt) B    (x)) - 2 ((I      t dt) B    (x) + (I  t dt) B    (x))
       ]              2, 3       ]          1, 2           ]             2, 3       ]         1, 2
       /                         /                         /                        /
        x - 1                     1                         x - 1                    1
     1                         x
    /                         /
    [       3                 [   3
   (I      t  dt) B    (x) + (I  t  dt) B    (x)
    ]              1, 2       ]          0, 1
    /                         /
     x - 1                     0
 + ---------------------------------------------
                         6
(%i32) %, nouns;
                 4      3      2                         4
                x  - 4 x  + 6 x  - 4 x + 1              x    81
          (64 - --------------------------) B    (x) + (-- - --) B    (x)
                            4                4, 5       4    4    3, 4
(%o32) (- ---------------------------------------------------------------)
                                         6
             3      2                         3                           2                         2
       64   x  - 3 x  + 3 x - 1              x                           x  - 2 x + 1              x    9
 + 2 ((-- - -------------------) B    (x) + (-- - 9) B    (x)) - 8 ((8 - ------------) B    (x) + (-- - -) B    (x))
       3             3            4, 5       3        3, 4                    2         4, 5       2    2   3, 4
                                                     4      3      2                         4
                                               81   x  - 4 x  + 6 x  - 4 x + 1              x
   32 ((5 - x) B    (x) + (x - 3) B    (x))   (-- - --------------------------) B    (x) + (-- - 4) B    (x)
                4, 5               3, 4        4                4                3, 4       4        2, 3
 + ---------------------------------------- + --------------------------------------------------------------
                      3                                                     2
            3      2                         3                            2                         2
           x  - 3 x  + 3 x - 1              x    8                   9   x  - 2 x + 1              x
 - 4 ((9 - -------------------) B    (x) + (-- - -) B    (x)) + 10 ((- - ------------) B    (x) + (-- - 2) B    (x))
                    3            3, 4       3    3   2, 3            2        2         3, 4       2        2, 3
                                                    4      3      2                         4
                                                   x  - 4 x  + 6 x  - 4 x + 1              x    1
   22 ((4 - x) B    (x) + (x - 2) B    (x))   (4 - --------------------------) B    (x) + (-- - -) B    (x)
                3, 4               2, 3                        4                2, 3       4    4   1, 2
 - ---------------------------------------- - -------------------------------------------------------------
                      3                                                     2
            3      2                         3                           2                         2
       8   x  - 3 x  + 3 x - 1              x    1                      x  - 2 x + 1              x    1
 + 2 ((- - -------------------) B    (x) + (-- - -) B    (x)) - 2 ((2 - ------------) B    (x) + (-- - -) B    (x))
       3            3            2, 3       3    3   1, 2                    2         2, 3       2    2   1, 2
                                                                                          4
                                                   4      3      2                       x  B    (x)
                                              1   x  - 4 x  + 6 x  - 4 x + 1                 0, 1
   2 ((3 - x) B    (x) + (x - 1) B    (x))   (- - --------------------------) B    (x) + -----------
               2, 3               1, 2        4               4                1, 2           4
 + --------------------------------------- + -------------------------------------------------------
                      3                                                 6
(%i33) expand (%);
        4               3                2                                             4               3
       x  B    (x)   5 x  B    (x)   25 x  B    (x)   125 x B    (x)   625 B    (x)   x  B    (x)   5 x  B    (x)
           4, 5            4, 5             4, 5             4, 5           4, 5          3, 4            3, 4
(%o33) ----------- - ------------- + -------------- - -------------- + ------------ - ----------- + -------------
           24              6               4                6               24             6              2
       2                                            4               3                2
   55 x  B    (x)   65 x B    (x)   655 B    (x)   x  B    (x)   5 x  B    (x)   35 x  B    (x)   25 x B    (x)
          3, 4            3, 4           3, 4          2, 3            2, 3             2, 3            2, 3
 - -------------- + ------------- - ------------ + ----------- - ------------- + -------------- - -------------
         4                2              24             4              2               4                2
                   4               3               2                                         4
   155 B    (x)   x  B    (x)   5 x  B    (x)   5 x  B    (x)   5 x B    (x)   5 B    (x)   x  B    (x)
        2, 3          1, 2            1, 2            1, 2           1, 2         1, 2          0, 1
 + ------------ - ----------- + ------------- - ------------- + ------------ - ---------- + -----------
        24             6              6               4              6             24           24
(%i34) plot2d (%o33, [x, -1, 6]), B[a,b](u) := if u >= a and u < b then 1 else 0;
(%o34)                                    [/home/robert/maxout8692.gnuplot_pipes]
(%i35) expand (subst(x=t, %o33)*B[x-1,x](t));
        4                            3                             2
       t  B    (t) B        (t)   5 t  B    (t) B        (t)   25 t  B    (t) B        (t)   125 t B    (t) B        (t)
           4, 5     x - 1, x            4, 5     x - 1, x             4, 5     x - 1, x             4, 5     x - 1, x
(%o35) ------------------------ - -------------------------- + --------------------------- - ---------------------------
                  24                          6                             4                             6
                                4                            3                             2
   625 B    (t) B        (t)   t  B    (t) B        (t)   5 t  B    (t) B        (t)   55 t  B    (t) B        (t)
        4, 5     x - 1, x          3, 4     x - 1, x            3, 4     x - 1, x             3, 4     x - 1, x
 + ------------------------- - ------------------------ + -------------------------- - ---------------------------
              24                          6                           2                             4
                                                             4                            3
   65 t B    (t) B        (t)   655 B    (t) B        (t)   t  B    (t) B        (t)   5 t  B    (t) B        (t)
         3, 4     x - 1, x           3, 4     x - 1, x          2, 3     x - 1, x            2, 3     x - 1, x
 + -------------------------- - ------------------------- + ------------------------ - --------------------------
               2                           24                          4                           2
       2                                                                                   4
   35 t  B    (t) B        (t)   25 t B    (t) B        (t)   155 B    (t) B        (t)   t  B    (t) B        (t)
          2, 3     x - 1, x            2, 3     x - 1, x           2, 3     x - 1, x          1, 2     x - 1, x
 + --------------------------- - -------------------------- + ------------------------- - ------------------------
                4                            2                           24                          6
      3                            2
   5 t  B    (t) B        (t)   5 t  B    (t) B        (t)   5 t B    (t) B        (t)   5 B    (t) B        (t)
         1, 2     x - 1, x            1, 2     x - 1, x           1, 2     x - 1, x         1, 2     x - 1, x
 + -------------------------- - -------------------------- + ------------------------- - -----------------------
               6                            4                            6                         24
    4
   t  B    (t) B        (t)
       0, 1     x - 1, x
 + ------------------------
              24
(%i36) integrate (%, t, minf, inf);
                                                     5                         x
                                                    /                         /
                                                    [       4                 [   4
                                                   (I      t  dt) B    (x) + (I  t  dt) B    (x)
                                                    ]              5, 6       ]          4, 5
       625 ((6 - x) B    (x) + (x - 4) B    (x))    /                         /
                     5, 6               4, 5         x - 1                     4
(%o36) ----------------------------------------- + ---------------------------------------------
                          24                                            24
        5                         x                          5                         x
       /                         /                          /                         /
       [       3                 [   3                      [       2                 [   2
   5 ((I      t  dt) B    (x) + (I  t  dt) B    (x))   25 ((I      t  dt) B    (x) + (I  t  dt) B    (x))
       ]              5, 6       ]          4, 5            ]              5, 6       ]          4, 5
       /                         /                          /                         /
        x - 1                     4                          x - 1                     4
 - ------------------------------------------------- + --------------------------------------------------
                           6                                                   4
          5                        x
         /                        /
         [                        [
   125 ((I      t dt) B    (x) + (I  t dt) B    (x))
         ]             5, 6       ]         4, 5
         /                        /                    655 ((5 - x) B    (x) + (x - 3) B    (x))
          x - 1                    4                                 4, 5               3, 4
 - ------------------------------------------------- - -----------------------------------------
                           6                                              24
     4                         x                        4                         x
    /                         /                        /                         /
    [       4                 [   4                    [       3                 [   3
   (I      t  dt) B    (x) + (I  t  dt) B    (x)   5 ((I      t  dt) B    (x) + (I  t  dt) B    (x))
    ]              4, 5       ]          3, 4          ]              4, 5       ]          3, 4
    /                         /                        /                         /
     x - 1                     3                        x - 1                     3
 - --------------------------------------------- + -------------------------------------------------
                         6                                                 2
         4                         x                          4                        x
        /                         /                          /                        /
        [       2                 [   2                      [                        [
   55 ((I      t  dt) B    (x) + (I  t  dt) B    (x))   65 ((I      t dt) B    (x) + (I  t dt) B    (x))
        ]              4, 5       ]          3, 4            ]             4, 5       ]         3, 4
        /                         /                          /                        /
         x - 1                     3                          x - 1                    3
 - -------------------------------------------------- + ------------------------------------------------
                           4                                                   2
                                                 3                         x
                                                /                         /
                                                [       4                 [   4
                                               (I      t  dt) B    (x) + (I  t  dt) B    (x)
                                                ]              3, 4       ]          2, 3
   155 ((4 - x) B    (x) + (x - 2) B    (x))    /                         /
                 3, 4               2, 3         x - 1                     2
 + ----------------------------------------- + ---------------------------------------------
                      24                                             4
        3                         x                          3                         x
       /                         /                          /                         /
       [       3                 [   3                      [       2                 [   2
   5 ((I      t  dt) B    (x) + (I  t  dt) B    (x))   35 ((I      t  dt) B    (x) + (I  t  dt) B    (x))
       ]              3, 4       ]          2, 3            ]              3, 4       ]          2, 3
       /                         /                          /                         /
        x - 1                     2                          x - 1                     2
 - ------------------------------------------------- + --------------------------------------------------
                           2                                                   4
         3                        x
        /                        /
        [                        [
   25 ((I      t dt) B    (x) + (I  t dt) B    (x))
        ]             3, 4       ]         2, 3
        /                        /                    5 ((3 - x) B    (x) + (x - 1) B    (x))
         x - 1                    2                               2, 3               1, 2
 - ------------------------------------------------ - ---------------------------------------
                          2                                             24
     2                         x                        2                         x
    /                         /                        /                         /
    [       4                 [   4                    [       3                 [   3
   (I      t  dt) B    (x) + (I  t  dt) B    (x)   5 ((I      t  dt) B    (x) + (I  t  dt) B    (x))
    ]              2, 3       ]          1, 2          ]              2, 3       ]          1, 2
    /                         /                        /                         /
     x - 1                     1                        x - 1                     1
 - --------------------------------------------- + -------------------------------------------------
                         6                                                 6
        2                         x                         2                        x
       /                         /                         /                        /
       [       2                 [   2                     [                        [
   5 ((I      t  dt) B    (x) + (I  t  dt) B    (x))   5 ((I      t dt) B    (x) + (I  t dt) B    (x))
       ]              2, 3       ]          1, 2           ]             2, 3       ]         1, 2
       /                         /                         /                        /
        x - 1                     1                         x - 1                    1
 - ------------------------------------------------- + -----------------------------------------------
                           4                                                  6
     1                         x
    /                         /
    [       4                 [   4
   (I      t  dt) B    (x) + (I  t  dt) B    (x)
    ]              1, 2       ]          0, 1
    /                         /
     x - 1                     0
 + ---------------------------------------------
                        24
(%i37) %, nouns;
               5      4       3       2                         5
              x  - 5 x  + 10 x  - 10 x  + 5 x - 1              x    1024
       (625 - -----------------------------------) B    (x) + (-- - ----) B    (x)
                               5                    5, 6       5     5     4, 5
(%o37) ---------------------------------------------------------------------------
                                           24
              4      3      2                         4
       625   x  - 4 x  + 6 x  - 4 x + 1              x
   5 ((--- - --------------------------) B    (x) + (-- - 64) B    (x))
        4                4                5, 6       4         4, 5
 - --------------------------------------------------------------------
                                    6
               3      2                         3                               2                         2
        125   x  - 3 x  + 3 x - 1              x    64                    25   x  - 2 x + 1              x
   25 ((--- - -------------------) B    (x) + (-- - --) B    (x))   125 ((-- - ------------) B    (x) + (-- - 8) B    (x))
         3             3            5, 6       3    3    4, 5             2         2         5, 6       2        4, 5
 + -------------------------------------------------------------- - ------------------------------------------------------
                                 4                                                            6
                                                        5      4       3       2                         5
                                                1024   x  - 5 x  + 10 x  - 10 x  + 5 x - 1              x    243
   625 ((6 - x) B    (x) + (x - 4) B    (x))   (---- - -----------------------------------) B    (x) + (-- - ---) B    (x)
                 5, 6               4, 5         5                      5                    4, 5       5     5    3, 4
 + ----------------------------------------- - ---------------------------------------------------------------------------
                      24                                                            6
             4      3      2                         4
            x  - 4 x  + 6 x  - 4 x + 1              x    81
   5 ((64 - --------------------------) B    (x) + (-- - --) B    (x))
                        4                4, 5       4    4    3, 4
 + -------------------------------------------------------------------
                                    2
              3      2                         3                            2                         2
        64   x  - 3 x  + 3 x - 1              x                            x  - 2 x + 1              x    9
   55 ((-- - -------------------) B    (x) + (-- - 9) B    (x))   65 ((8 - ------------) B    (x) + (-- - -) B    (x))
        3             3            4, 5       3        3, 4                     2         4, 5       2    2   3, 4
 - ------------------------------------------------------------ + ----------------------------------------------------
                                4                                                          2
                                                       5      4       3       2                         5
                                                243   x  - 5 x  + 10 x  - 10 x  + 5 x - 1              x    32
   655 ((5 - x) B    (x) + (x - 3) B    (x))   (--- - -----------------------------------) B    (x) + (-- - --) B    (x)
                 4, 5               3, 4         5                     5                    3, 4       5    5    2, 3
 - ----------------------------------------- + -------------------------------------------------------------------------
                      24                                                           4
             4      3      2                         4
       81   x  - 4 x  + 6 x  - 4 x + 1              x
   5 ((-- - --------------------------) B    (x) + (-- - 4) B    (x))
       4                4                3, 4       4        2, 3
 - ------------------------------------------------------------------
                                   2
             3      2                         3                            2                         2
            x  - 3 x  + 3 x - 1              x    8                   9   x  - 2 x + 1              x
   35 ((9 - -------------------) B    (x) + (-- - -) B    (x))   25 ((- - ------------) B    (x) + (-- - 2) B    (x))
                     3            3, 4       3    3   2, 3            2        2         3, 4       2        2, 3
 + ----------------------------------------------------------- - ----------------------------------------------------
                                4                                                         2
                                                      5      4       3       2                         5
                                                32   x  - 5 x  + 10 x  - 10 x  + 5 x - 1              x    1
   155 ((4 - x) B    (x) + (x - 2) B    (x))   (-- - -----------------------------------) B    (x) + (-- - -) B    (x)
                 3, 4               2, 3        5                     5                    2, 3       5    5   1, 2
 + ----------------------------------------- - -----------------------------------------------------------------------
                      24                                                          6
            4      3      2                         4
           x  - 4 x  + 6 x  - 4 x + 1              x    1
   5 ((4 - --------------------------) B    (x) + (-- - -) B    (x))
                       4                2, 3       4    4   1, 2
 + -----------------------------------------------------------------
                                   6
            3      2                         3                           2                         2
       8   x  - 3 x  + 3 x - 1              x    1                      x  - 2 x + 1              x    1
   5 ((- - -------------------) B    (x) + (-- - -) B    (x))   5 ((2 - ------------) B    (x) + (-- - -) B    (x))
       3            3            2, 3       3    3   1, 2                    2         2, 3       2    2   1, 2
 - ---------------------------------------------------------- + ---------------------------------------------------
                               4                                                         6
                                                                                                   5
                                                   5      4       3       2                       x  B    (x)
                                              1   x  - 5 x  + 10 x  - 10 x  + 5 x - 1                 0, 1
   5 ((3 - x) B    (x) + (x - 1) B    (x))   (- - -----------------------------------) B    (x) + -----------
               2, 3               1, 2        5                    5                    1, 2           5
 - --------------------------------------- + ----------------------------------------------------------------
                     24                                                     24
(%i38) expand (%);
           5              4                                                                             5
          x  B    (x)    x  B    (x)                                                    324 B    (x)   x  B    (x)
              5, 6           5, 6         3                2                                 5, 6          4, 5
(%o38) (- -----------) + ----------- - 3 x  B    (x) + 18 x  B    (x) - 54 x B    (x) + ------------ + -----------
              120             4              5, 6             5, 6            5, 6           5             24
                     3                2                                              5               4
                 19 x  B    (x)   89 x  B    (x)   409 x B    (x)   1829 B    (x)   x  B    (x)   3 x  B    (x)
    4                   4, 5             4, 5             4, 5            4, 5          3, 4            3, 4
 - x  B    (x) + -------------- - -------------- + -------------- - ------------- - ----------- + -------------
       4, 5            2                2                4               20             12              2
       3                2                                             5                             3
   21 x  B    (x)   71 x  B    (x)   231 x B    (x)   731 B    (x)   x  B    (x)                 9 x  B    (x)
          3, 4             3, 4             3, 4           3, 4          2, 3       4                  2, 3
 - -------------- + -------------- - -------------- + ------------ + ----------- - x  B    (x) + -------------
         2                2                4               20            12            2, 3            2
       2                                           5             4             3             2
   19 x  B    (x)   39 x B    (x)   79 B    (x)   x  B    (x)   x  B    (x)   x  B    (x)   x  B    (x)   x B    (x)
          2, 3            2, 3          2, 3          1, 2          1, 2          1, 2          1, 2         1, 2
 - -------------- + ------------- - ----------- - ----------- + ----------- - ----------- + ----------- - ----------
         2                4             20            24             4             2             2            4
               5
   B    (x)   x  B    (x)
    1, 2          0, 1
 + -------- + -----------
      20          120
(%i39) plot2d (%o38, [x, -1, 6]), B[a,b](u) := if u >= a and u < b then 1 else 0;
(%o39)                                    [/home/robert/maxout8692.gnuplot_pipes]
(%i40) 

(%i41) load (facexp);
(%o41)          /usr/local/share/maxima/branch_5_37_base_126_g36028d1_dirty/share/simplification/facexp.mac
(%i42) collectterms (2*f(4) + x*f(4) + 4*f(2) + (y+1)*f(2), f(4), f(2));
(%o42)                                          f(2) (y + 5) + f(4) (x + 2)
(%i43) collectterms (%o38, B[0,1](x), B[1,2](x), B[2,3](x), B[3,4](x), B[4,5](x), B[5,6](x));
            5      4                                           5            3       2
           x      x       3       2          324              x     4   19 x    89 x    409 x   1829
(%o43) ((- ---) + -- - 3 x  + 18 x  - 54 x + ---) B    (x) + (-- - x  + ----- - ----- + ----- - ----) B    (x)
           120    4                           5    5, 6       24          2       2       4      20    4, 5
        5       4       3       2                             5           3       2
       x     3 x    21 x    71 x    231 x   731              x     4   9 x    19 x    39 x   79
 + ((- --) + ---- - ----- + ----- - ----- + ---) B    (x) + (-- - x  + ---- - ----- + ---- - --) B    (x)
       12     2       2       2       4     20    3, 4       12         2       2      4     20   2, 3
                                                5
        5     4    3    2                      x  B    (x)
       x     x    x    x    x   1                  0, 1
 + ((- --) + -- - -- + -- - - + --) B    (x) + -----------
       24    4    2    2    4   20   1, 2          120
(%i44) makelist (integrate (%o38, x, k, k+1), k, 0, 5),  B[a,b](u) := if u >= a and u < b then 1 else 0;
first: empty argument.
#0: extract_variable_boxcar(eqns=[aa = (x^5*B[0,1](x))/(if x >= 0 and x < 1 then 1 else 0),uu = x,cc = 1,bb = 0],variable=x,lower_limit=0,upper_limit=1)
#1: FOO(aa=x^5,bb=B[0,1](x),uu=x,cc1=0,cc2=1)(boxcar_convolution.mac line 32)
 -- an error. To debug this try: debugmode(true);
(%i45) args (%o43);
             5      4                                          5            3       2
            x      x       3       2          324             x     4   19 x    89 x    409 x   1829
(%o45) [((- ---) + -- - 3 x  + 18 x  - 54 x + ---) B    (x), (-- - x  + ----- - ----- + ----- - ----) B    (x), 
            120    4                           5    5, 6      24          2       2       4      20    4, 5
     5       4       3       2                            5           3       2
    x     3 x    21 x    71 x    231 x   731             x     4   9 x    19 x    39 x   79
((- --) + ---- - ----- + ----- - ----- + ---) B    (x), (-- - x  + ---- - ----- + ---- - --) B    (x), 
    12     2       2       2       4     20    3, 4      12         2       2      4     20   2, 3
                                            5
     5     4    3    2                     x  B    (x)
    x     x    x    x    x   1                 0, 1
((- --) + -- - -- + -- - - + --) B    (x), -----------]
    24    4    2    2    4   20   1, 2         120
(%i46) map(first, %);
            5      4                               5            3       2
           x      x       3       2          324  x     4   19 x    89 x    409 x   1829
(%o46) [(- ---) + -- - 3 x  + 18 x  - 54 x + ---, -- - x  + ----- - ----- + ----- - ----, 
           120    4                           5   24          2       2       4      20
    5       4       3       2                 5           3       2                  5     4    3    2
   x     3 x    21 x    71 x    231 x   731  x     4   9 x    19 x    39 x   79     x     x    x    x    x   1
(- --) + ---- - ----- + ----- - ----- + ---, -- - x  + ---- - ----- + ---- - --, (- --) + -- - -- + -- - - + --, 
   12     2       2       2       4     20   12         2       2      4     20     24    4    2    2    4   20
 5
x  B    (x)]
    0, 1
(%i47) reverse (%);
                         5     4    3    2            5           3       2
         5              x     x    x    x    x   1   x     4   9 x    19 x    39 x   79
(%o47) [x  B    (x), (- --) + -- - -- + -- - - + --, -- - x  + ---- - ----- + ---- - --, 
            0, 1        24    4    2    2    4   20  12         2       2      4     20
    5       4       3       2                 5            3       2
   x     3 x    21 x    71 x    231 x   731  x     4   19 x    89 x    409 x   1829
(- --) + ---- - ----- + ----- - ----- + ---, -- - x  + ----- - ----- + ----- - ----, 
   12     2       2       2       4     20   24          2       2       4      20
    5      4
   x      x       3       2          324
(- ---) + -- - 3 x  + 18 x  - 54 x + ---]
   120    4                           5
(%i48) assume (x>4, x<5);
(%o48)                                                 [x > 4, x < 5]
(%i49) ''%o38;
                                            5            3       2
                                           x     4   19 x    89 x    409 x   1829
(%o49)                                     -- - x  + ----- - ----- + ----- - ----
                                           24          2       2       4      20
(%i50) forget (x>4, x<5);
(%o50)                                                 [x > 4, x < 5]
(%i51) makelist (block([foo],assume(x>k,x<k+1), foo:integrate (%o38, x, k, k+1), forget(x>k,x<k+1), foo), k, 0, 5);
first: empty argument.
#0: extract_variable_boxcar(eqns=[aa = x^5*B[0,1](x),uu = x,cc = 1,bb = 0],variable=x,lower_limit=0,upper_limit=1)
#1: FOO(aa=x^5,bb=B[0,1](x),uu=x,cc1=0,cc2=1)(boxcar_convolution.mac line 32)
 -- an error. To debug this try: debugmode(true);
(%i52) makelist (block([foo],assume(x>k,x<k+1), ev(%o38), foo:integrate (%%, x, k, k+1), forget(x>k,x<k+1), foo), k, 0, 5);
                                                 1   19   151  151  19    1
(%o52)                                         [---, ---, ---, ---, ---, ---]
                                                720  240  360  360  240  720
(%i53) float (%);
(%o53) [0.001388888888888889, 0.07916666666666666, 0.4194444444444445, 0.4194444444444445, 0.07916666666666666, 
                                                                                                       0.001388888888888889]
(%i54) load(distrib);
(%o54)             /usr/local/share/maxima/branch_5_37_base_126_g36028d1_dirty/share/distrib/distrib.mac
(%i55) makelist (pdf_binomial (k, 5, 1/2), k, 0, 5);
                                                   1   5   5   5   5   1
(%o55)                                            [--, --, --, --, --, --]
                                                   32  32  16  16  32  32
(%i56) float (%);
(%o56)                              [0.03125, 0.15625, 0.3125, 0.3125, 0.15625, 0.03125]
(%i57) 
